// Написать программу вычисления значения функции y=f(a)


double y (double x)
{
  return x*x;
}
Console.WriteLine (y(2));


